#include "led.h"


u8 Cont = 0;

/*³õÊ¼»¯¶¨Ê±Æ÷T0,ÓÃÀ´¸øLED¶¨Ê±£¬ÈÃÆäÒÔ1sµÄÆµÂÊÉÁË¸*/
void LED_Timer0_Init(void) //10ms
{
  TMOD &= 0x0f;   //#0000 xxxx  µ±TR0ÖÃÎ»Ê±¾ÍÆô¶¯¶¨Ê±Æ÷0
	                //            ¶¨Ê±Æ÷T0ÓÃÓÚÄÚ²¿¶¨Ê±
	                //            [M1M0]=00,¶¨Ê±Æ÷T0¹¤×÷ÔÚ16Î»×Ô¶¯ÖØ×°¶¨Ê±Æ÷Ä£Ê½£
	
	TH0 = 0XB8;     //¶¨Ê±Æ÷T0³õÖµ0xB800,¼´10ms¶¨Ê±
	TL0 = 0;
	
	TR0 = 1;       //Æô¶¯¶¨Ê±Æ÷T0
	
	ET0 = 1;       //¿ª¶¨Ê±Æ÷T0ÖÐ¶Ï
	
	EA = 1;        //¿ª×ÜÖÐ¶Ï

}

/*Ê¹LEDµÆ500msÉÁË¸1´Î*/
void Timer0() interrupt 1   
{
	 Cont++;
	 if(Cont > 50)
	 {
		 Cont = 0;
		 LED = !LED;					
   }
}







/**********************************THE END**********************************/ 